TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/examples/aes/aes_ex4_gcm_decrypt.c
interrupt void AESDMADataInISR(void)
{
    AES_disableDMARequest(AESA_BASE, AES_DMA_EN_DATA_IN);
    dataInDMADoneIntFlag = true;
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP7);
}

interrupt void AESDMADataOutISR(void)
{
    AES_disableDMARequest(AESA_BASE, AES_DMA_EN_DATA_OUT);
    dataOutDMADoneIntFlag = true;
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP7);
}

void initializeDMACH1(void)
{
    DMA_disableTrigger(DMA_CH1_BASE);
    DMA_clearTriggerFlag(DMA_CH1_BASE);
    DMA_clearErrorFlag(DMA_CH1_BASE);
}

void initializeDMACH2(void)
{
    DMA_disableTrigger(DMA_CH2_BASE);
    DMA_clearTriggerFlag(DMA_CH2_BASE);
    DMA_clearErrorFlag(DMA_CH2_BASE);
}
void configureDMACH1(const void *src, const void *dst, uint32_t transferSize)
{
    //
    //Configure DMA Channel 1 as needed
    //
    DMA_configAddresses(DMA_CH1_BASE,dst,src);
    //
    // Burst configuration with 4 32 bit words/burst. Destination is not moving.
    //
    DMA_configBurst(DMA_CH1_BASE,BURST_SIZE,BURST_SRCSTEP,0);
    //
    // Transfer configuration with 4 bursts/transfer. Destination is not moving.
    //
    DMA_configTransfer(DMA_CH1_BASE,transferSize,TRANSFER_SRCSTEP,0);
    //
    // Wrap condition enabled if more than 256 bursts/transfer
    //
    DMA_configWrap(DMA_CH1_BASE,SRCWRAPSIZE,WRAP_SRCSTEP,DESTWRAPSIZE,WRAP_DESTSTEP);
    DMA_configMode(DMA_CH1_BASE,DMA_TRIGGER_AESA_DATAIN,DMA_CFG_ONESHOT_DISABLE |
                   DMA_CFG_CONTINUOUS_DISABLE | DMA_CFG_SIZE_32BIT);
    DMA_enableTrigger(DMA_CH1_BASE);
}

void configureDMACH2(const void *src, const void *dst, uint32_t transferSize)
{
    //
    //Configure DMA Channel 2 as needed
    //
    DMA_configAddresses(DMA_CH2_BASE,dst,src);
    //
    // Burst configuration with 4 32 words/burst. Source is not moving.
    //
    DMA_configBurst(DMA_CH2_BASE,BURST_SIZE,0,BURST_DESTSTEP);
    //
    // Transfer configuration with 4 bursts/transfer. Source is not moving.
    //
    DMA_configTransfer(DMA_CH2_BASE,transferSize,0,TRANSFER_DESTSTEP);
    //
    // Wrap condition enabled if more than 256 bursts/transfer
    //
    DMA_configWrap(DMA_CH2_BASE,SRCWRAPSIZE,WRAP_SRCSTEP,DESTWRAPSIZE,WRAP_DESTSTEP);
    DMA_configMode(DMA_CH2_BASE,DMA_TRIGGER_AESA_DATAOUT,DMA_CFG_ONESHOT_DISABLE |
                   DMA_CFG_CONTINUOUS_DISABLE | DMA_CFG_SIZE_32BIT);
    DMA_enableTrigger(DMA_CH2_BASE);
}

void configureDMAInterruptCH1(void)
{
    //
    // Register the interrupt handler.
    //
    Interrupt_register(INT_DMA_CH1, AESDMADataInISR);

    //
    // Enable the DMA interrupt.
    //
    Interrupt_enable(INT_DMA_CH1);
    Interrupt_enableGlobal();
    DMA_enableInterrupt(DMA_CH1_BASE);
    //
    // generate the interrupt at the end of the transfer.
    //
    DMA_setInterruptMode(DMA_CH1_BASE,DMA_INT_AT_END);
}

void configureDMAInterruptCH2(void)
{
    //
    // Register the interrupt handler.
    //
    Interrupt_register(INT_DMA_CH2, AESDMADataOutISR);

    //
    // Enable the DMA interrupt.
    //
    Interrupt_enable(INT_DMA_CH2);
    Interrupt_enableGlobal();
    DMA_enableInterrupt(DMA_CH2_BASE);
    //
    // generate the interrupt at the end of the transfer.
    //
    DMA_setInterruptMode(DMA_CH2_BASE,DMA_INT_AT_END);
}

void initilizeAES(void)
{
    Interrupt_disableGlobal();
    AES_disableGlobalInterrupt(AESA_SS_BASE);
    AES_performSoftReset(AESA_BASE);
}

void startAES(void)
{
    //
    //start the DMA Channel and wait for the trigger event.
    //
    DMA_startChannel(DMA_CH1_BASE);
    //
    //start the DMA Channel and wait for the trigger event.
    //
    DMA_startChannel(DMA_CH2_BASE);

    AES_enableDMARequest(AESA_BASE, AES_DMA_EN_DATA_IN | AES_DMA_EN_DATA_OUT);
}

//
// Main
//
void main(void)
{
    //
    // Initialize device clock and peripherals
    //
    Device_init();

    //
    // Initialize GPIO and configure the GPIO pin as a push-pull output
    //
    Device_initGPIO();

    //
    // Disable global interrupts.
    //
    DINT;

    //
    // Initialize PIE and clear PIE registers. Disables CPU interrupts.
    //
    Interrupt_initModule();

    //
    // Initialize the PIE vector table with pointers to the shell Interrupt
    // Service Routines (ISR).
    //
    Interrupt_initVectorTable();

    //
    // Enable Global Interrupt (INTM) and realtime interrupt (DBGM)
    //
    EINT;
    ERTM;

    //
    // Initialize variables
    //
    errorCountGlobal = 0U;
    for(cnt = 0; cnt < 64; cnt++)
    {
        plainTextArray[cnt] = 0U;
    }
    for(cnt = 0; cnt < 4; cnt++)
    {
        tagArray[cnt] = 0U;
    }

    //
    // Perform AES Soft Reset
    //
    AES_performSoftReset(AESA_BASE);

    //
    // Loop through all the given vectors
    //
    for(vectorCnt = 0;
        (vectorCnt < (sizeof(testVectorGCMArray) /
         sizeof(testVectorGCMArray[0]))) && (errorCountGlobal == 0U); vectorCnt++)
    {
        //
        // Get the current vector's data members
        //
        keySize  = testVectorGCMArray[vectorCnt].keySize;
        keyArray = testVectorGCMArray[vectorCnt].keyArray;
        ivLength = testVectorGCMArray[vectorCnt].ivLength;
        ivArray  = testVectorGCMArray[vectorCnt].ivArray;
        dataLength         = testVectorGCMArray[vectorCnt].dataLength;
        expPlainTextArray  = testVectorGCMArray[vectorCnt].plainTextArray;
        authDataLength     = testVectorGCMArray[vectorCnt].authDataLength;
        authDataArray      = testVectorGCMArray[vectorCnt].authDataArray;
        cipherTextArray = testVectorGCMArray[vectorCnt].cipherTextArray;
        expTagArray        = testVectorGCMArray[vectorCnt].tagArray;

        //
        // Clear the arrays containing the plain-text and tag to ensure things
        // are working correctly
        //
        for(cnt = 0; cnt < (dataLength / 4U); cnt++)
        {
            plainTextArray[cnt] = 0U;
        }
        for(cnt = 0; cnt < 4; cnt++)
        {
            tagArray[cnt] = 0U;
        }

        //
        // If both the data lengths are zero, then it's a special case
        //
        if((dataLength == 0U) && (authDataLength == 0U))
        {
            //
            // Performing decryption without uDMA
            //

            //
            // Figure out the value of Y0 depending on the IV length
            //
            getGCMY0(keySize, ivArray, ivLength, keyArray, y0Array);

            //
            // Perform the basic encryption
            //
            performECBEncryption(keySize, y0Array, tagArray, keyArray, 16U);
        }
        else
        {
            //
            // Figure out the value of Y0 depending on the IV length
            //
            getGCMY0(keySize, ivArray, ivLength, keyArray, y0Array);

            //
            // Perform the decryption without uDMA
            //
            performGCMDecryption(keySize, cipherTextArray, plainTextArray,
                          dataLength, keyArray, y0Array, authDataArray,
                          authDataLength, tagArray, false);
        }

        //
        // Check the results
        //
        for(cnt = 0; cnt < (dataLength / 4U); cnt++)
        {
            if(expPlainTextArray[cnt] != plainTextArray[cnt])
            {
                //
                // Plain-text mismatch on word
                //
                errorCountGlobal |= ((cnt << 16U) | 0x00000004U);
            }
        }
        for(cnt = 0; cnt < 4; cnt++)
        {
            if(expTagArray[cnt] != tagArray[cnt])
            {
                //
                // Tag mismatch on word
                //
                errorCountGlobal |= ((cnt << 16U) | 0x00000003U);
            }
        }

        //
        // Clear the arrays containing the plain-text and tag to ensure things
        // are working correctly
        //
        for(cnt = 0; cnt < (dataLength / 4U); cnt++)
        {
            plainTextArray[cnt] = 0U;
        }
        for(cnt = 0; cnt < 4; cnt++)
        {
            tagArray[cnt] = 0U;
        }

        //
        // Only use DMA with the vectors that have data
        //
        if((dataLength != 0U) || (authDataLength != 0U))
        {
            //
            // Perform the decryption with uDMA
            //
            performGCMDecryption(keySize, cipherTextArray, plainTextArray,
                          dataLength, keyArray, y0Array, authDataArray,
                          authDataLength, tagArray, true);

            //
            // Check the result
            //
            for(cnt = 0; cnt < (dataLength / 4U); cnt++)
            {
                if(expPlainTextArray[cnt] != plainTextArray[cnt])
                {
                    //
                    // Plain-text mismatch on word
                    //
                    errorCountGlobal |= ((cnt << 16U) | 0x00000004U);
                }
            }
            for(cnt = 0; cnt < 4; cnt++)
            {
                if(expTagArray[cnt] != tagArray[cnt])
                {
                    //
                    // Tag mismatch on word
                    //
                    errorCountGlobal |= ((cnt << 16U) | 0x00000003U);
                }
            }
        }
    }

    //
    // Clean up AES Data registers
    //
    AES_performSoftReset(AESA_BASE);

    //
    // Update test status variable
    //
    if(errorCountGlobal == 0U)
    {
        testStatusGlobal = TEST_PASS;
    }
    else
    {
        testStatusGlobal = TEST_FAIL;
    }

    //
    // Wait forever
    //
    while(1)
    {
    }
}

//
// performECBEncryption - Perform an AES-ECB decryption operation.
//
void performECBEncryption(AES_KeySize keySize, uint32_t *srcArray,
                          uint32_t *dstArray,   uint32_t *keyArray,
                          uint32_t dataLength)
{
    //
    // Perform a soft reset
    //
    AES_performSoftReset(AESA_BASE);

    //
    // Configure the AES module
    //
    AES_ConfigParams aesConfig;
    memset(&aesConfig, 0U, sizeof(AES_ConfigParams));
    aesConfig.direction = AES_DIRECTION_ENCRYPT;
    aesConfig.keySize = keySize;
    aesConfig.opMode = AES_OPMODE_ECB;
    AES_configureModule(AESA_BASE, &aesConfig);

    //
    // Write the key
    //
    AES_setKey1(AESA_BASE, keyArray, keySize);

    //
    // Perform the encryption
    //
    AES_processData(AESA_BASE, srcArray, dstArray, dataLength);
}

//
// getGCMY0 - Calculate the Y0 value that needs to be written into the IV
// registers. Note: Y0 will always be 128 bits.
//
void getGCMY0(AES_KeySize keySize, uint32_t *ivArray, uint32_t ivLength,
              uint32_t *keyArray, uint32_t *y0Array)
{
    uint32_t hashSubkeyArray[8U];

    //
    // If the length is 96 bits, then just set the last bit of the IV to 1
    //
    if(ivLength == 12U)
    {
        y0Array[0] = ivArray[0];
        y0Array[1] = ivArray[1];
        y0Array[2] = ivArray[2];
        y0Array[3] = 0x01000000U;
    }

    //
    // If the length is not 96 bits, then perform a basic GHASH on the IV
    //
    else
    {
        //
        // First, get the hash subkey or H
        //
        getHashSubKey(keySize, keyArray, hashSubkeyArray);

        //
        // Next, perform the GHASH operation
        //
        performGHASHOperation(keySize, hashSubkeyArray, ivArray, ivLength,
                              y0Array);
    }
}

//
// getHashSubKey - Calculate hash subkey(H) with the given key.
// This is performed by encrypting 128 zeroes with the key.
//
void getHashSubKey(AES_KeySize keySize, uint32_t *keyArray,
                   uint32_t *hashSubkeyArray)
{
    uint32_t zeroArray[8];

    //
    // Put zeroes into the first 4 words of the array
    //
    zeroArray[0] = 0x0U;
    zeroArray[1] = 0x0U;
    zeroArray[2] = 0x0U;
    zeroArray[3] = 0x0U;

    //
    // Put zeroes into the next 4 words if the key size is 256bit
    //
    if(keySize == AES_KEY_SIZE_256BIT)
    {
        zeroArray[4] = 0x0U;
        zeroArray[5] = 0x0U;
        zeroArray[6] = 0x0U;
        zeroArray[7] = 0x0U;
    }

    //
    // Perform the decryption
    //
    performECBEncryption(keySize, zeroArray, hashSubkeyArray, keyArray,
                  (keySize == AES_KEY_SIZE_128BIT ? 16U : 32U));
}

//
// performGHASHOperation - Perform a basic GHASH operation with the hashsubkey
// and IV. This is used to get Y0 when the IV is not 96 bits.  To use this GCM
// mode, the operation direction must not be set and the counter should be
// disabled.
//
void performGHASHOperation(AES_KeySize keySize, uint32_t *hashSubkeyArray,
                           uint32_t *ivArray, uint32_t ivLength,
                           uint32_t *resultTagArray)
{
    uint32_t ghashCnt;

    //
    // Perform a soft reset
    //
    AES_performSoftReset(AESA_BASE);

    //
    // Configure the AES module
    //
    AES_ConfigParams aesConfig;
    memset(&aesConfig, 0U, sizeof(AES_ConfigParams));
    aesConfig.keySize = (AES_KeySize)keySize;
    aesConfig.opMode = AES_OPMODE_GCM_HLY0ZERO;
    AES_configureModule(AESA_BASE, &aesConfig);

    //
    // Set the hash subkey
    //
    AES_setKey2(AESA_BASE, hashSubkeyArray, keySize);

    //
    // Write the lengths
    //
    AES_setDataLength(AESA_BASE, ivLength);
    AES_setAuthDataLength(AESA_BASE, 0U);

    //
    // Write the data
    //
    for(ghashCnt = 0; ghashCnt < ivLength; ghashCnt += 16)
    {
        //
        // Write the data registers
        //
        AES_writeDataBlocking(AESA_BASE, (ivArray + (ghashCnt / 4U)));
    }

    //
    // Read the hash tag value
    //
    AES_readTag(AESA_BASE, resultTagArray);
}

//
// performGCMDecryption - Perform GCM decryption operation.
//
void performGCMDecryption(AES_KeySize keySize, uint32_t *srcArray,
                          uint32_t *dstArray, uint32_t dataLength,
                          uint32_t *keyArray, uint32_t *ivArray,
                          uint32_t *aadArray, uint32_t aadLength,
                          uint32_t *tagArray, bool useDMA)
{
    //
    // Clear the interrupt flags
    //
    contextInIntFlag = false;
    dataInIntFlag = false;
    contextOutIntFlag = false;
    dataOutIntFlag = false;
    contextInDMADoneIntFlag = false;
    dataInDMADoneIntFlag = false;
    contextOutDMADoneIntFlag = false;
    dataOutDMADoneIntFlag = false;

    //
    // Perform a soft reset.
    //
    initilizeAES();

    //
    // Configure the AES module
    //
    AES_ConfigParams aesConfig;
    memset(&aesConfig, 0, sizeof(AES_ConfigParams));
    aesConfig.direction = AES_DIRECTION_DECRYPT;
    aesConfig.keySize = keySize;
    aesConfig.opMode = AES_OPMODE_GCM_HY0CALC;
    AES_configureModule(AESA_BASE, &aesConfig);

    //
    // Write the initialization value
    //
    AES_setInitializationVector(AESA_BASE, ivArray);

    //
    // Write the keys
    //
    AES_setKey1(AESA_BASE, keyArray, keySize);

    //
    // Depending on the argument, perform the decryption
    // with or without uDMA
    //
    if(useDMA)
    {
        DMA_initController();

        if(aadLength != 0U)
        {
            //
            // Setup the DMA module to copy auth data in
            //
            initializeDMACH1();
            configureDMACH1((const void*)aadArray,
                            (const void*)(AESA_BASE + AES_O_DATA_IN_OUT_0),
                            (roundUpDataLength(aadLength) / 16U));
            configureDMAInterruptCH1();
        }

        //
        // Setup the DMA module to copy the data out
        //
        initializeDMACH2();
        configureDMACH2((const void*)(AESA_BASE + AES_O_DATA_IN_OUT_0),
                        (const void*)dstArray,
                        (roundUpDataLength(dataLength) / 16U));
        configureDMAInterruptCH2();

        //
        // Write the cipher-text length
        //
        AES_setDataLength(AESA_BASE, (uint64_t)(dataLength));

        //
        // Write the auth length registers to start the process
        //
        AES_setAuthDataLength(AESA_BASE, aadLength);

        //
        // Enable the DMA channels to start the transfers. This must be done
        // after writing the length to prevent data from copying before the
        // context is truly ready
        //
        if(aadLength != 0U)
        {
            //
            //start the DMA Channel and wait for the trigger event.
            //
            DMA_startChannel(DMA_CH1_BASE);
        }
        //
        //start the DMA Channel and wait for the trigger event.
        //
        DMA_startChannel(DMA_CH2_BASE);

        //
        // Enable DMA requests
        //
        AES_enableDMARequest(AESA_BASE,(AES_DMA_EN_DATA_IN |
                                       AES_DMA_EN_DATA_OUT));

        if(aadLength != 0U)
        {
            //
            // Wait for the data in DMA done interrupt
            //
            while(!dataInDMADoneIntFlag)
            {
            }
        }

        if(dataLength != 0U)
        {
            //
            // Enable DMA requests
            //
            AES_disableDMARequest(AESA_BASE,(AES_DMA_EN_DATA_IN |
                                           AES_DMA_EN_DATA_OUT));
            //
            // Setup the uDMA to copy the plain-text data
            //
            initializeDMACH1();
            configureDMACH1((const void*)srcArray,
                            (const void*)(AESA_BASE + AES_O_DATA_IN_OUT_0),
                            (roundUpDataLength(dataLength) / 16U));
            configureDMAInterruptCH1();
            //
            //start the DMA Channel and wait for the trigger event.
            //
            DMA_startChannel(DMA_CH1_BASE);

            //
            // Enable DMA requests
            //
            AES_enableDMARequest(AESA_BASE,(AES_DMA_EN_DATA_IN |
                                           AES_DMA_EN_DATA_OUT));

            //
            // Wait for the data out DMA done interrupt
            //
            while(!dataOutDMADoneIntFlag)
            {
            }
        }

        //
        // Read out the tag.
        //
        AES_readTag(AESA_BASE, tagArray);
    }
    else
    {
        //
        // Enable all interrupts
        //
        AES_enableInterrupt(AESA_BASE, (AES_INT_CONTEXT_IN |
                            AES_INT_CONTEXT_OUT | AES_INT_DATA_IN    |
                            AES_INT_DATA_OUT));

        //
        // Perform the decryption
        //
        AES_processDatainAuthMode(AESA_BASE, srcArray, dstArray, dataLength,
                                  aadArray, aadLength, tagArray);
    }
}

//
// roundUpDataLength - Round up length to nearest 16 byte boundary.  This is
// needed because all four data registers must be written at once.  This is
// handled in the AES driver, but if using uDMA, the length must rounded up.
//
uint32_t roundUpDataLength(uint32_t dataLength)
{
    uint32_t remainder;

    remainder = dataLength % 16U;
    if(remainder == 0U)
    {
        return(dataLength);
    }
    else
    {
        return(dataLength + (16U - remainder));
    }
}

//
// End of File
//
